src/integ-test/bdd-test/resources/xml/verifyPaymentNoticeBody_noOptional.xml

            
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nod="http://pagopa-api.pagopa.gov.it/node/nodeForPsp.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <nod:verifyPaymentNoticeReq>
            <idPSP>$idPSP</idPSP>
            <idBrokerPSP>$idBrokerPSP</idBrokerPSP>
            <idChannel>$idChannel</idChannel>
            <password>$password</password>
            <qrCode>
                <fiscalCode>$fiscalCode</fiscalCode>
                <noticeNumber>$noticeNumber</noticeNumber>
            </qrCode>
        </nod:verifyPaymentNoticeReq>
    </soapenv:Body>
</soapenv:Envelope>